{
  "meta-index": {
    "portfolio-title": "Tom SIOUAN",
    "portfolio-og-title": "Home page of the portfolio",
    "portfolio-og-content": "Full-stack developer. I am passionate about new technologies and I am always looking for new projects to undertake."
  },

  "home-title": "Tom Siouan",
  "home-first-subtitle": "Computer Science Student",
  "home-second-subtitle": "at IUT Nord-Franche-Comté located in Belfort (FR).",

  "home-slogan": "Full Stack Developer",

  "learn-more": "Learn more...",

  "filter-by-tag": "Filter by tags",

  "open-in-github": "Open in GitHub",
  "go-back-home": "Go back home",
  "go-back": "Go back",

  "nav-about": "About",
  "nav-skills": "Skills",
  "nav-projects": "Projects",
  "nav-stages": "Internship",
  "nav-contact": "Contact",

  "video-not-working": "Your browser does not support the video tag.",

  "download-cv": "Download my CV",

  "section-title-about-me": "About me",
  "section-about-me-first-paragraph": "Hello! My name is Tom, I'm 20 years old. I've been passionate about computers since I was about 6 years old. It's always interested me, and it came quite naturally to me. I have a great interest in the creative potential that technology offers us, but I also see the possibilities to improve our daily lives and the world around us. I started learning programming when I was around 17. Until then, I used to code scripts for Minecraft. I've always enjoyed challenges and creating innovative things. My enthusiasm for digital innovation and my thirst for knowledge constantly drive me to learn and experiment with new technologies, in order to contribute to the evolution of the digital world.",
  "section-about-me-second-paragraph": "I am currently in my 2nd year of a Bachelor's degree in Computer Science. We are learning about different fields such as algorithms, optimization, networks, databases, and modeling...",

  "timeline-bac-date": "2022",
  "timeline-bac-title": "Technological Baccalaureate STI2D",
  "timeline-bac-description": "Sciences and Technologies of Industry and Sustainable Development, <br/>option: Information and Digital Systems",

  "timeline-but-date": "September 1<sup>st</sup>, 2022",
  "timeline-but-title": "Entered Computer Science BUT",
  "timeline-but-description": "University Bachelor's Degree in Technology.",
  "timeline-but-sub-description": "✅ 1<sup>st</sup> year validated.",

  "timeline-stage-truetourism-date": "April 8 - June 31, 2024",
  "timeline-stage-truetourism-title": "Programmer Analyst Internship",
  "timeline-stage-truetourism-description-first-part": "Internship completed in the 2<sup>nd</sup> year of BUT at ",
  "timeline-stage-truetourism-description-second-part": ". A Marseille-based startup in the tourism sector.",

  "section-title-projects": "My Projects",
  "section-title-stages": "Internships",
  "section-title-contact": "Contact me",

  "footer-first": "Computer sciences student",
  "footer-second": "Based in Belfort (90), France",
  "footer-third": "I am currently working on side projects in addition to those for school.",
  "footer-used-techno": "Website made using",

  "today": "today",

  "heldia-title": "Heldia",
  "heldia-image-alt": "image of the game titled Heldia",
  "heldia-description": "Project involving the creation of a 2D RPG video game.",
  "heldia-content": "<section id=\"introduction\">\n      <h2 class=\"font-kineticRegular text-3xl text-start font-extrabold mb-5\">Introduction</h2>\n      <p class=\"text-justify\">\n        Always passionate about video games since a young age, I decided in 2022 to create a game. Being a fan of 2D games (with Pokémon and Zelda shaping my childhood), I decided to create a game. I didn't know where to start because I hardly knew programming at that time. However, what I did know was that I wanted to create a game where I could recreate the ambiance of the old Pokémon and Zelda games. As I already had some basic knowledge of C# at that time, I quickly came across the framework <a class=\"text-color-transition text-blue-500 underline dark:hover:text-blue-400 hover:text-blue-400\" href=\"https://monogame.net/\">Monogame</a> (formerly XNA), a framework used for developing Terraria and Stardew Valley. I then started to learn about this framework through a few YouTube videos and about the architecture needed to run a game from scratch. This is where my project truly begins.\n      </p>\n    </section>\n    <section id=\"developpement\" class=\"text-justify\">\n      <h2 class=\"font-kineticRegular text-3xl text-start font-extrabold mt-10 mb-5\">Architecture</h2>\n      <p>\n        I started by creating the game architecture based on a screen system (which I call pages), meaning there is a class that manages my screens, defining which screen to display or not.\n        The pages then manage the screen refresh (FPS) and game logic (TPS) by themselves.\n      </p>\n\n      <h2 class=\"font-kineticRegular text-3xl text-start font-extrabold mt-10 mb-5\">Player</h2>\n      <p>\n        When implementing a player, several ideas and challenges quickly arose.\n        I had to create a system to play animations using a spritesheet, a camera to follow my player,\n        a stamina and health system, as well as managing keybinds.\n        So I started by creating an animation system to render spritesheets in order to have an animated image.\n      </p>\n\n      <h2 class=\"font-kineticRegular text-3xl text-start font-extrabold mt-10 mb-5\">Spritesheet and Animations</h2>\n      <p>\n        The result was not immediate, but I eventually created a Spritesheet class coupled with a file manager that returns the corresponding file.\n        Then, an animation class handles animating the file.\n      </p>\n\n      <h2 class=\"font-kineticRegular text-3xl text-start font-extrabold mt-10 mb-5\">Camera</h2>\n      <p>\n        After animating my player, I moved him temporarily with hard-coded controls in the player code.\n        These controls were not flexible as there was no settings menu at that time.\n        My player moved, but the screen remained fixed at x=0 and y=0. So I created a Camera class that, with a few simple matrix calculations, follows my player.\n      </p>\n\n      <h2 class=\"font-kineticRegular text-3xl text-start font-extrabold mt-10 mb-5\">Spritesheet Manager</h2>\n      <p>\n        This result was not achieved immediately, but when I started implementing the tiles composing the environment,\n        I realized that a manager to handle which sprites to display would be effective. So I created the TilesManager.\n      </p>\n\n      <h2 class=\"font-kineticRegular text-3xl text-start font-extrabold mt-10 mb-5\">ObjectManager</h2>\n      <p>\n        It takes an array as a parameter and handles rendering the elements.\n        I use it to render the map.\n      </p>\n\n      <h2 class=\"font-kineticRegular text-3xl text-start font-extrabold mt-10 mb-5\">Map</h2>\n      <p>\n        Currently, the map operates on the principle of procedural generation with Perlin noise.\n        However, I plan to replace this generation with a fixed map. For that, I need to create my own mapping software\n        to create my map and obtain a file that my game can use. It's a difficult task, so I haven't paid attention to it yet.\n        Currently, the map uses an ObjectManager to render its components.\n      </p>\n\n      <h2 class=\"font-kineticRegular text-3xl text-start font-extrabold mt-10 mb-5\">Collisions</h2>\n      <p>\n        Each GameObject has a rectangle that corresponds to its internal hitbox. I used this to create my Collision class which takes\n        two GameObjects as parameters and checks if they touch.\n      </p>\n      <p>\n        When my player touches another object present in my ObjectManager, it gets reported and then, from the Player class, I decide\n        what the player should do in case of a collision. For now, I haven't implemented any enemies, so there is only one ObjectManager.\n        However, when I implement a layer system, it will be more optimized and the program won't need to go through all the objects to check\n        for collisions.\n      </p>\n\n      <h2 class=\"font-kineticRegular text-3xl text-start font-extrabold mt-10 mb-5\">Health and Stamina</h2>\n      <p>\n        Now that I had a collision system and a player capable of moving, I decided to implement a health\n        and stamina system. I created two objects, but I encountered a display issue. I couldn't place these two objects on the same layer as the player\n        since they don't actually belong to the game. I had to create an Overlay system to display them and keep them static on the screen.\n      </p>\n\n      <h2 class=\"font-kineticRegular text-3xl text-start font-extrabold mt-10 mb-5\">Timer</h2>\n      <p>\n        When I coded my health and stamina systems, I didn't immediately think of implementing a timer. I quickly encountered the\n        issue of not being able to make my player lose health while also making him lose or gain stamina.\n        After some research, I discovered the importance of the Timer. Indeed, in a game, everything is timed. So I created a\n        Timer class that I implemented in the Spritesheet Manager to manage the image sweeping speed.\n        I also used it to manage my local game time variable. The Timer also allows me to calculate TPS and FPS frequencies.\n      </p>\n\n      <h2 class=\"font-kineticRegular text-3xl text-start font-extrabold mt-10 mb-5\">Singleton</h2>\n      <p>\n        Next, I wanted to implement settings to manage the game controls. These settings are still in development.\n        I needed a class to centralize the data and exchange it more easily between different components.\n        So I created a Singleton to simplify this management. This allowed me to gain performance by reducing data transactions between\n        classes.\n        After implementing the Singleton, I modified my Camera class to allow it to move to a defined point and thus create cinematics.\n      </p>\n\n      <h2 class=\"font-kineticRegular text-3xl text-start font-extrabold mt-10 mb-5\">Controls</h2>\n      <p>\n        I already had my Overlay system, I simply added an overlay for the controls. These are still in development.\n      </p>\n\n      <h2 class=\"font-kineticRegular text-3xl text-start font-extrabold mt-10 mb-5\">To Do</h2>\n      <p>\n        The project is not finished, and there is still a lot to do. Currently, I am working on the settings to change controls in the game.\n        Next, I plan to change the animations to allow my player to attack enemies.\n      </p>\n    </section>\n    <section id=\"conclusion\" class=\"text-justify\">\n      <h2 class=\"font-kineticRegular text-3xl text-start font-extrabold mt-10 mb-5\">Conclusion</h2>\n      <p>\n        Thanks to this project, even though it is not finished, I have learned C# and Monogame in-depth.\n        I have acquired the fundamentals related to creating a 2D video game. I now know one of the possible architectures for a\n        2D video game project. This project has also changed my way of thinking and approaching code. It has allowed me to develop my skills in\n        algorithms.\n      </p>\n    </section>\n",

  "portfolio-title": "Portfolio",
  "portfolio-image-alt": "image of the portfolio (current site)",
  "portfolio-description": "Website you are currently on.",
  "portfolio-content": "<section id=\"introduction\">\n      <h2 class=\"font-kineticRegular text-3xl text-start font-extrabold mb-5\">Introduction</h2>\n      <p class=\"text-justify\" >\n        This project addresses the primary need to create a portfolio in the form of a website as part of the Computer Science BUT. However, I have always had the idea, more or less, to create a site for this purpose.\n      </p>\n    </section>\n    <section id=\"development\" class=\"text-justify\">\n      <h2 class=\"font-kineticRegular text-3xl text-start font-extrabold mt-10 mb-5\">Technologies Used</h2>\n      <p>\n        I needed a technology that would allow me to achieve results quickly. I came across Nuxt quite by chance and decided very quickly that it was the technology I was going to use. By reading the documentation, I quickly realized that this framework would allow me to set up my site quickly thanks to the various modules it offers. Additionally, I decided to use Tailwind CSS to save time.\n      </p>\n\n      <h2 class=\"font-kineticRegular text-3xl text-start font-extrabold mt-10 mb-5\">Design</h2>\n      <p>\n        I opted for a clean design based on black and white, giving a strong contrast. I also focused on animations to make the site more dynamic.\n      </p>\n <h2 class=\"font-kineticRegular text-3xl text-start font-extrabold mt-10 mb-5\">SMTP Server</h2> <p>With the help of my domain name and an SMTP server, I was able to implement the email sending functionality, receiving them on a dedicated email address.</p>     <h2 class=\"font-kineticRegular text-3xl text-start font-extrabold mt-10 mb-5\">Languages</h2>\n      <p>\n        I used the\n        <a class=\"text-color-transition text-blue-500 underline dark:hover:text-blue-400 hover:text-blue-400\" href=\"https://nuxt.com/modules/i18n\">nuxt/i18n</a>\n        module to translate my site. The problem I have with this technology is that nuxt/i18n only offers client-side translation, so I am considering revising my translation system in the future.\n      </p>\n    </section>\n    <section id=\"conclusion\" class=\"text-justify\">\n      <h2 class=\"font-kineticRegular text-3xl text-start font-extrabold mt-10 mb-5\">Conclusion</h2>\n      <p>\n        This project gave me the opportunity to apply the knowledge and skills I developed during the first two years of my Computer Science BUT, both in networking and programming. I was also able to leverage the experience gained during my internship.\n      </p>\n    </section>",

  "mediaplayer-title": "QTMP",
  "mediaplayer-image-alt": "Image of the qt media player",
  "mediaplayer-description": "Multimedia player.",
  "mediaplayer-content": "<section id=\"introduction\">\n      <h2 class=\"font-kineticRegular text-3xl text-start font-extrabold mb-5\">Project Overview</h2>\n      <p class=\"text-justify\">\n        This project involves the development of a multimedia player using C++ with the\n        QT framework (version 6.6.3). Initially, my goal was to implement the basic functions of a video player, meaning to play a video and control it using\n        buttons and a progress bar.\n        This multimedia player allows the playback of video and audio files such as\n        .mp4, .mkv, .avi, and .mov files through simple drag and drop or by clicking a button and manually selecting the file. It's possible to create a\n        playlist of files as well as a library. The library is persistent, meaning that the files placed in it will remain there even after restarting the application.\n      </p>\n    </section>\n    <section id=\"development\" class=\"text-justify flex flex-col gap-4\">\n\n      <h2 class=\"font-kineticRegular text-3xl text-start font-extrabold mt-10\">Using the Application</h2>\n      <div class=\"flex flex-col gap-4\">\n        <p>\n          Using the application is very simple. Upon launching the application, you are presented with this interface:\n        </p>\n\n        <img src=\"/images/qt-mediaplayer/home.webp\" alt=\"Image of the multimedia player\" class=\"w-2/3 mt-10 mb-10 mx-auto\" />\n\n        <p>\n          You immediately notice three areas and the ability to drag and drop a file into the main area thanks to the image and text \"Drop media\n          here.\" Users can also manually select a file by clicking the \"play\" button. This button also plays videos/music. In the current version of the\n          project, clicking the different sidebar tabs, if the user has imported files by right-clicking \"Add new item\" or by dragging and dropping, presents this interface:\n        </p>\n\n        <img src=\"/images/qt-mediaplayer/playlist.webp\" alt=\"Image of the multimedia player\" class=\"w-2/3 mt-10 mb-10 mx-auto\" />\n\n        <p>\n          Here, a table appears containing the list of files added to the program. Each list is independent. This means that \"Playlist\" does not contain the\n          same list of files as \"Media Library.\" These lists contain key information such as title, author, and total duration of each file. (The author is yet to be implemented, requiring an external library). Each sidebar section presents this\n          same interface. In \"My Videos,\" you find all the videos (.mp4, .avi, .mkv, .mov) present in the dedicated video folder of the operating system. Double-clicking a\n          row allows you to play a video or music. If a music file is double-clicked, you stay on this list view, but if it's a video, a preview is launched:\n        </p>\n\n        <img src=\"/images/qt-mediaplayer/playing.webp\" alt=\"Image of the multimedia player\" class=\"w-2/3 mt-10 mb-10 mx-auto\" />\n\n        <p>\n          Users can pause or resume the video/music at the stopped moment using the play button. They can increase the volume using the volume bar.\n          Make the window fullscreen using the button at the bottom right of the window or exit the media by clicking the stop button. Fast forward or rewind by clicking the progress bar (on Linux, you need to grab the slider and drag it).\n        </p>\n\n        <p>\n          From the Playlist, My Videos, and soon My Music (yet to be implemented) screens, it's possible to right-click to delete an item from the list or copy it\n          to the Media Library.\n        </p>\n\n        <p>\n          It remains to implement the My Music section and the ability to advance in a\n          playlist. The \"previous\" and \"next\" buttons do not work.\n        </p>\n\n        <img src=\"/images/qt-mediaplayer/copy-to-library.webp\" alt=\"Image of the multimedia player\" class=\"w-2/3 mt-10 mb-10 mx-auto\" />\n      </div>\n\n      <h2 class=\"font-kineticRegular text-3xl text-start font-extrabold mt-10\">Remaining Development Points</h2>\n      <div class=\"flex flex-col gap-4\">\n        <p>\n          The application is far from complete. The goal is ultimately to have a fully functional multimedia player. We could think of implementing a photo playback system that displays\n          each photo for about ten seconds like VLC does, for example, to create slideshows. It also remains to implement the playlist scrolling system, which\n          is currently not operational. This means that when a video is played and ends, instead of returning to the screen with the list of videos/music, the application continues\n          by playing the next media in the list. The \"previous\" and \"next\" buttons would allow changing the currently playing media by loading the previous or next media in the list.\n          Finally, the logic of the menu bar needs to be implemented to have a well-finished application, at least in terms of functionality.\n        </p>\n      </div>\n\n      <h2 class=\"font-kineticRegular text-3xl text-start font-extrabold mt-10\">Technical Description</h2>\n      <div class=\"flex flex-col gap-4\">\n        <p>\n          Developing this project has been a significant opportunity for me, not\n          only in terms of expanding my technical skills but also in gaining a deeper understanding of the C++ programming language and\n          the practical application of the QT framework. Immersion in the C++ language has been an enriching experience; this language, known for its complexity and power, has challenged and encouraged\n          me to improve my programming logic. Through this project, I have been able to explore advanced aspects\n          of C++, such as memory management, which has strengthened my technical foundation and expanded my skill set in software development.\n        </p>\n\n        <p>\n          Integrating the QT framework into this project has been a revelation, opening the doors to\n          a multitude of graphical features and a simplified approach to designing\n          user interfaces. QT, as a cross-platform framework, has allowed me to create a visually appealing application that can run on various operating systems\n          without significant code modifications. This flexibility has proven valuable, making me appreciate the importance of portability and accessibility in modern software development.\n        </p>\n\n        <p>\n          To complete this project, I primarily relied on Stack Overflow and other\n          various forums.\n        </p>\n      </div>\n\n      <h2 class=\"font-kineticRegular text-3xl text-start font-extrabold mt-10\">Challenges Faced</h2>\n      <p>\n        Regarding the challenges encountered, I mainly faced issues with\n        memory leaks due to incorrect use of pointers and an incomplete understanding\n        of C++. These errors resulted in the loss of several hours, but thanks to\n        effective use of the debugger, I was eventually able to resolve them. This improved\n        my debugging skills. Additionally, navigating through the abundance of features\n        offered by QT proved complex, exacerbated by documentation that, in my opinion, could\n        be improved to facilitate the learning and application of this framework.\n      </p>\n    </section>\n    <section id=\"conclusion\" class=\"text-justify\">\n      <h2 class=\"font-kineticRegular text-3xl text-start font-extrabold mt-10 mb-5\">Conclusion</h2>\n      <p>\n        This multimedia player project, developed in C++ with the QT framework (version 6.6.3), has been a significant learning experience.\n        Initially aimed at implementing the basic functions of a video player, the project evolved to support video and audio playback\n        for various formats such as .mp4, .mkv, .avi, and .mov. The application allows users to create playlists and\n        maintain a persistent media library, offering a seamless and user-friendly experience.\n      </p>\n      <p>\n        The development process has been straightforward, with intuitive drag-and-drop functionality and manual file selection enhancing user interaction. Despite some challenges, such as handling memory leaks and navigating QT’s extensive features, these hurdles provided valuable lessons in debugging and underscored the importance of thorough documentation.\n      </p>\n      <p>\n        Future improvements include implementing the \"My Music\" section, playlist progression, and enhancing the user interface further. This project not only expanded my technical skills in C++ and QT but also deepened my understanding of software portability and cross-platform development.\n      </p>\n      <p>\n        Overall, this project allowed me to apply my knowledge and skills in a practical context, preparing me for more complex challenges in software development. The experience underscored the importance of persistence, continuous learning, and leveraging community resources such as Stack Overflow for problem-solving.\n      </p>\n    </section>",

  "habit-tracker-title": "HabitTracker",
  "habit-tracker-image-alt": "Image of the application",
  "habit-tracker-description": "Swift application for habit management.",
  "habit-tracker-content": "<section id=\"introduction\">\n      <h2 class=\"font-kineticRegular text-3xl text-start font-extrabold mb-5\">Overview</h2>\n      <p class=\"text-justify\">\n        HabitTracker, as the name suggests, is a habit tracker that allows you to list your habits,\n        schedule them by recurrence (every day, every other day, etc.), and, with the help of a calendar,\n        observe the list of your habits for each day.\n      </p>\n      <p>\n        This application was created as a university project with the aim of training us in the Swift language and\n        mobile programming in general.\n      </p>\n    </section>",


  "ezcon-title": "EZCON",
  "ezcon-image-alt": "Image of the website",
  "ezcon-description": "Website for a video game convention",
  "ezcon-content": "<section id=\"introduction\">\n      <h2 class=\"font-kineticRegular text-3xl text-start font-extrabold mb-5\">Introduction</h2>\n      <p class=\"text-justify\">\n        This website originated from a university project where we were tasked with creating a website related to an event.\n        Therefore, this website is dedicated to a video game convention named EzCon, which is supposed to take place in Belfort (90), France.\n      </p>\n    </section>\n    <section id=\"development\" class=\"text-justify\">\n      <h2 class=\"font-kineticRegular text-3xl text-start font-extrabold mt-10 mb-5\">Objective</h2>\n      <p>\n        This project aims to offer a range of complementary services for the convention. It includes the management of speakers and exhibitors,\n        allowing for the allocation of booths and the scheduling of events. The schedule and events can be viewed on the site through the convention map.\n      </p>\n\n      <h2 class=\"font-kineticRegular text-3xl text-start font-extrabold mt-10 mb-5\">Features</h2>\n      <ul class=\"list-disc pl-12 flex flex-col gap-4 pl-10\">\n        <li>\n          Event Calendar: Check the calendar to know all the events happening at the convention.\n        </li>\n        <li>\n          Online Booking: Reserve your tickets and various products offered by different exhibitors.\n        </li>\n        <li>\n          Information: Discover the world of video games like never before.\n        </li>\n        <li>\n          Translation: The site is available in English for international visitors.\n        </li>\n      </ul>\n    </section>\n    <section id=\"conclusion\" class=\"text-justify\">\n      <h2 class=\"font-kineticRegular text-3xl text-start font-extrabold mt-10 mb-5\">Conclusion</h2>\n      <p>\n        This project allowed me to develop substantial knowledge of Vue.js 2, as well as improve my ability to work in a team and my understanding of agile project management methodologies. Through this experience, I have gained valuable skills in web development, project coordination, and the practical application of modern development frameworks.\n      </p>\n      <p>\n        Overall, the EzCon website project has been a significant learning opportunity, enabling me to apply theoretical knowledge in a practical context. This experience has been instrumental in preparing me for future challenges in the field of web development and project management.\n      </p>\n    </section>",

"index-contact-me-p1": "As a second-year Computer Science student, I am looking for new opportunities to apply my skills and collaborate on innovative projects.",
  "index-contact-me-p2": "You can send me an <a href=\"#email-form\">email</a> or contact me on the following networks ↓",

  "form-fullname": "Full name",
  "form-email": "Email",
  "form-subject": "Subject",
  "form-message": "Message",
  "form-send-button": "Send",

  "index-truetourism-paragraph": "During my 2<sup>nd</sup> year in the Computer Science BUT program, I completed an 8-week internship at a startup called True Tourism.\n            During this internship, I had the opportunity to work on developing an innovative mobile application dedicated to tourism in Marseille.\n            My role included designing and implementing key features such as application cache optimization, adding user profiles,\n            sending notifications and emails to users, templating emails, adding Google as an authentication provider, and creating E2E tests.\n            This experience not only strengthened my technical skills but also gave me valuable insights into the dynamic startup environment...",

  "truetourism-title": "Internship at True Tourism",
  "truetourism-introduction": "During my 2<sup>nd</sup> year in the Computer Science BUT program, I completed an 8-week internship at a startup called True Tourism\n          composed of 4 members. During this internship, I had the opportunity to work on developing an innovative mobile application dedicated to\n          tourism in Marseille. My role included designing and implementing key features such as application cache optimization,\n          adding user profiles, sending notifications and emails to users, templating emails, adding Google as an authentication provider,\n          and creating E2E tests. This experience not only strengthened my technical skills but also gave me valuable insights into the dynamic startup environment.",
  "truetourism-first-section-title": "Development of a React Native Application",
  "truetourism-first-section-p1": "During my internship, I developed features for a mobile application using\n              <a href=\"https://reactnative.dev\" class=\"text-color-transition text-blue-500 underline dark:hover:text-blue-400 hover:text-blue-400\">React Native</a>,\n              <a href=\"https://graphql.org\" class=\"text-color-transition text-blue-500 underline dark:hover:text-blue-400 hover:text-blue-400\">GraphQL</a>, and\n              <a href=\"https://www.typescriptlang.org\" class=\"text-color-transition text-blue-500 underline dark:hover:text-blue-400 hover:text-blue-400\">TypeScript</a>.\n              I actively participated in discussions about code structure and had to overcome challenges related to the lack of technical documentation. This work involved developing a public profile page for guides on the application,\n              implementing Google as an authentication provider, and creating End-to-End tests to ensure the application's reliability.",
  "truetourism-first-section-subtitle1": "End-to-End Tests",
  "truetourism-first-section-p2": "The first task assigned to me was to create End-to-End tests with <a href=\"https://maestro.mobile.dev\" class=\"text-color-transition text-blue-500 underline dark:hover:text-blue-400 hover:text-blue-400\">Maestro</a>, a technology I was not familiar with at all.\n                      So I had to learn how to use this technology, which allows, through scripts, to automatically perform actions in the simulator.\n                      Thanks to comprehensive documentation, I quickly got the hang of Maestro and used it effectively.",
  "truetourism-first-section-subtitle2": "Implementation of a Public Profile for Guides",
  "truetourism-first-section-p3": "I was also tasked with developing a React Native profile screen dedicated to guides working with the company\n                    on the application so that tourists (application users) could access it and see what each guide offers.\n                    To do this, I first analyzed the existing components in the application\n                    to reuse or adapt them for my task to maintain component harmony within the application.\n                    This task also taught me ReactNative and some basic concepts related to navigation, as well as GraphQL, which is used\n                    to query the database.",
  "truetourism-first-section-subtitle3": "Implementation of Google as an Authentication Provider",
  "truetourism-first-section-subtitle4": "Skills",
  "truetourism-first-section-sub-subtitle1": "Skills Developed:",
  "truetourism-first-section-p4": "Recently, I implemented Google as an authentication provider. It had to be implemented with Nhost, an open-source Backend-as-a-Service.\n                    Nhost manages user account connections for the application, so it is necessary to go through it to link a Google account to a\n                    user or create an account via Google.",
  "truetourism-first-section-p5": "The first problem encountered was an error related to the Nhost API, making the use of Nhost-provided methods impossible.\n                    An issue was created on GitHub, and it appears to be still unresolved as of this writing (June 11, 2024).\n                    So I had to find alternatives by researching online to redirect the user to the Google login interface.",
  "truetourism-first-section-p6": "The second problem was that when a user attempted to log in with Google but the account did not exist, Nhost\n                    automatically created the account and logged the user in. However, the application uses data that the Google account cannot provide, and this data is requested from the user during registration through the application.",
  "truetourism-first-section-p7": " I had to redesign the account creation screens to separate account creation from user profile creation.\n                    Thus, once logged in via Google (if their account did not already exist), the user is redirected to the profile creation screens.",
  "truetourism-first-section-p8": "The first name and last name information were then transferred to the next screen, allowing account and profile separation in the screen flow.",
  "truetourism-first-section-p9": " I also had to ensure that when a user arrives on the application, if they are logged in but their profile is not completed,\n                    they are redirected to the profile creation screens and cannot exit. I added a variable to check whether the user profile\n                    is completed or not, as well as another to know if the account was created with Google.",
  "truetourism-first-section-p10": "Since the authentication database is linked to Nhost and thus not modifiable, all user data\n                    (related to the application/user profile) is placed in a field named metadata. This field contains an object with all\n                    the variables used by the application. I added two boolean variables: googleAccount to know if the account was\n                    created with Google or not, and completed to know if the profile is complete or not.",
  "truetourism-first-section-p11": "Based on these variables, I had to modify the terms of service display conditions.",
  "truetourism-first-section-p12": "When a tourist creates an account with Google, the application directly retrieves the image that Google returns, which required me to slightly modify\n                    how profile images are displayed. However, when a guide creates their account with Google, they have the choice between\n                    adding an image from their directory or keeping the Google image.",
  "truetourism-first-section-p13": "For login, when an account already existed on Nhost with a certain email address and the user attempted to log in\n                    via Google with that same email address, Nhost automatically linked the Google account to the pre-existing account.\n                    Therefore, I did not have to handle this case. However, I had to add in the user profile options the possibility\n                    to link and unlink the Google account, in case the user account was not created by Google.",
  "truetourism-first-section-p14": "Finally, I created a diagram to state my progress on the task, make an assessment, and enable other developers to\n                    more easily understand my work.",
  "truetourism-first-section-p15": "This task allowed me to develop my ability to search for precise information, such as consulting issues on GitHub. I gained a better understanding of the work environment, which included a PostgreSQL database exposed via a GraphQL API running on Hasura, all connected to Nhost. This understanding of the architecture helped me identify the advantages and disadvantages of these tools. Additionally, it strengthened my ability to analyze existing code and quickly adapt to new technologies.",
  "truetourism-first-section-skills1": "<b>Research and Analysis:</b> My ability to search for precise and relevant information was greatly improved. I used GitHub and other online resources to solve technical problems and understand best practices.",
  "truetourism-first-section-skills2": "<b>Understanding of Architecture:</b> Working with a PostgreSQL database exposed via a GraphQL API on Hasura and connected to Nhost allowed me to better understand the strengths and limitations of these technologies. This was crucial for optimizing the application's performance and efficiency.",
  "truetourism-first-section-skills3": "<b>Adaptation and Learning:</b> I was able to quickly adapt to technologies and tools that I did not know before. This experience reinforced my ability to learn new technologies autonomously and integrate them effectively into my projects.",
  "truetourism-first-section-skills4": "<b>Code Analysis:</b> Analyzing pre-existing code to understand its functioning and modify it according to needs helped me develop a structured and methodical approach to programming.",
  "truetourism-first-section-skills5": "<b>Increased proficiency with the following technologies/tools:</b> React Native, TypeScript, GraphQL, Nhost, Hasura.",

  "truetourism-first-section-subtitle5": "Optimizing Price Calculation Using React Query",
  "truetourism-first-section-react-query-alt": "Image of the React Query implementation in App.js",
  "truetourism-first-section-fetchPriceDetailsCallback-label": "fetchPriceDetails function",
  "truetourism-first-section-fetchPriceDetailsCallback-alt": "Image of the fetchPriceDetails function code defined using useCallback.",
  "truetourism-first-section-useQuery-label": "return useQuery",
  "truetourism-first-section-useQuery-alt": "Image of the useQuery hook return code.",
  "truetourism-first-section-sub-subtitle2": "Overall Functionality",
  "truetourism-first-section-p16": "First of all, what is React Query? React Query is a library for managing query state and asynchronous data in React applications.\n",
  "truetourism-first-section-p17": "Transactions between the application and the API that returns prices are chargeable beyond a certain level. For a small structure like True Tourism, it was essential to minimize the number of requests.\n",
  "truetourism-first-section-p18": "So I started by implementing React Query at the root of the application:",
  "truetourism-first-section-p19": "Then I modified the custom hook named <span class=\"bg-gray-300 pl-2 pr-2 rounded\">useFetchPriceDetails</span> to use React Query:",
  "truetourism-first-section-p20": "The <span class=\"bg-gray-300 pl-2 pr-2 rounded\">fetchPriceDetails</span> function is defined using\n                  <span class=\"bg-gray-300 pl-2 pr-2 rounded\">useCallback</span> to memoize the function and only recreate it\n                  when dependencies change. It makes a POST request to the <span class=\"bg-gray-300 pl-2 pr-2 rounded\">/price</span> endpoint with the request body constructed based on the parameters.",
  "truetourism-first-section-p21": "<span class=\"bg-gray-300 pl-2 pr-2 rounded\">useQuery</span> is used to execute the <span class=\"bg-gray-300 pl-2 pr-2 rounded\">fetchPriceDetails</span> function and manage its state\n                  (loading, success, error).<br/>\n                  The parameters are:",
  "truetourism-first-section-p22": "<b>Query key:</b> An array that includes the necessary parameters to differentiate requests.\n                      This key allows caching results specific to these parameters.",
  "truetourism-first-section-p23": "<b>Fetch function:</b> The <span class=\"bg-gray-300 pl-2 pr-2 rounded\">fetchPriceDetails</span> function.",
  "truetourism-first-section-p24": "<b>Options:</b>",
  "truetourism-first-section-p25": "<b>keepPreviousData:</b> Allows keeping previous data while updating to avoid \"flickers\".",
  "truetourism-first-section-p26": "<b>staleTime:</b> Defines the time during which the data is considered fresh. Here, it is set to\n                          0 if a discount code is provided, otherwise to 5 minutes.",
  "truetourism-first-section-p27": "The term \"flicker\" (or \"flickering\") refers to a phenomenon where a part of the user interface flashes or changes state rapidly in a visible manner, often unexpectedly and unpleasantly for the user. This usually happens when the data displayed on the screen changes too quickly or when there is a visible period between the loading of old and new data.\n                  <br/>\n                  In the context of React Query and the provided code, \"flickers\" can occur in the following situations:",
  "truetourism-first-section-p28": "<b>Loading new data:</b> When a new request is made to update the data, there may be a moment where the old data is removed before the new data is fully loaded. This can cause a flicker where the user sees an empty interface or a loading state before the new data is displayed.",
  "truetourism-first-section-p29": "<b>Change of loading state:</b> If the application quickly switches from displaying data to a loading state\n                      (for example, showing a loading indicator) and vice versa, this can cause visible flickers.",
  "truetourism-first-section-p30": "<b>Initialization:</b> The <span class=\"bg-gray-300 pl-2 pr-2 rounded\">useFetchPriceDetails</span> function is called with the necessary parameters.\n",
  "truetourism-first-section-p31": "<b>Creation of the fetch function:</b> <span class=\"bg-gray-300 pl-2 pr-2 rounded\">fetchPriceDetails</span> is defined and memoized.\n",
  "truetourism-first-section-p32": "<b>Execution of the request:</b> <span class=\"bg-gray-300 pl-2 pr-2 rounded\">useQuery</span> executes <span class=\"bg-gray-300 pl-2 pr-2 rounded\">fetchPriceDetails</span> and manages the state of the request.",
  "truetourism-first-section-p33": "<b>Cache and state management:</b> React Query caches the results and manages the different states (loading, success, error) transparently.\n",
  "truetourism-first-section-p34": "In conclusion, this task being the first one I worked on in React Native and TypeScript,\n                  I learned to use types without overloading the code. I also learned to create and use custom hooks\n                  and understood the importance of keeping optimization in mind. Moreover, optimizing requests\n                  to avoid overloading servers proved crucial, especially for a small structure like True Tourism.\n                  Implementing React Query not only reduced costs by minimizing the number of API requests, but also\n                  improved the user experience by making data transitions smoother and avoiding \"flickers\".",
  "truetourism-second-section-title": "Setting Up a Notion to Centralize Management Tools",
  "truetourism-second-section-p1": "One of my tasks was to create a Notion space to coordinate the technical teams with the marketing and communication departments.\n                  The company used various software, including Retool, Trello, and HubSpot (CRM, customer management tool),\n                  with the goal of automatically centralizing all data on Notion. This project being secondary, I worked on it one\n                  afternoon per week from my 5<sup>th</sup> week of internship, totaling 4 afternoons. I did not have\n                  time to develop all aspects of the company. For this, I had to take into account everyone's expectations\n                  to create a Notion space adapted and in line with the company's image.",
  "truetourism-second-section-p2": "This Notion brings together all the data (business, operational, processes, communication). For my part, I focused solely on the\n                  operational and business aspects (user part).",
  "truetourism-second-section-p3": "I first created a global space to set the company's objectives (simple Kanban view) and another dedicated to weekly meetings.",
  "truetourism-second-section-p4": "Then, I set up a space for each team member with a Kanban view to manage each person's tasks, similar to Trello.\n                  The company already used Trello, but it was restrictive because, for example, to get a Gantt chart, you had to pay. On Notion, by configuring it correctly,\n                  you can view a Gantt chart for free. Cost is a crucial factor in this type of structure with limited funds.",
  "truetourism-second-section-p5": "I centralized the list of users, distinguishing two types: guides and tourists.\n                  What interested César, the general and marketing director, was mainly the guides because the company closely follows them.\n                  It was therefore essential for César to have access to different views to classify \"guide\" users in various ways.",
  "truetourism-second-section-p6": "Here is an image of a part of the Notion. For confidentiality reasons, I cannot show more on this site.",
  "truetourism-second-section-p7": "This project allowed me to develop my project management skills by setting up a Notion (management tool) and\n                    understanding the users' needs, namely the team. It also allowed me to develop essential interpersonal skills for working in a multidisciplinary team, such as communication, collaboration,\n                    conflict management, and adaptability.",
  "truetourism-second-section-skills1": "<b>Understanding Client and User Needs:</b> I learned to gather and formalize the needs of different departments to create a centralized and effective management tool on Notion.",
  "truetourism-second-section-skills2": "<b>Setting Up Project Management Tools:</b> By creating a space on Notion, I implemented project management tools adapted to the team's needs, facilitating coordination and task tracking.",
  "truetourism-second-section-skills3": "<b>Identifying Stakeholders and Development Phases:</b> I identified the roles and responsibilities of each team member to ensure a clear distribution of tasks and better collaboration.",
  "truetourism-second-section-skills4": "<b>Project Monitoring:</b> I applied a project monitoring approach using Kanban views and Gantt charts, allowing effective and transparent activity management.",
  "truetourism-second-section-skills5": "<b>Communication and Collaboration:</b> Working on this project allowed me to develop crucial interpersonal skills, such as effective communication, conflict management, and collaboration within a multidisciplinary team.",
  "truetourism-second-section-subtitle1": "Skills",
  "truetourism-second-section-sub-subtitle2": "Skills Developed:",

  "truetourism-ccl-section-title": "Conclusion",
  "truetourism-ccl-section-p1": "This internship at True Tourism allowed me to develop flexibility and adaptability\n                essential due to the diversity of projects carried out over a short period of eight weeks.\n                This experience enriched my technical and interpersonal skills, essential for evolving\n                in the field of computer science and project management.",
  "truetourism-ccl-section-skills1": "<b>Research and Analysis:</b> I improved my ability to search for precise and relevant information.\n                        Using GitHub and other online resources to solve technical problems and understand\n                        best practices was crucial.",
  "truetourism-ccl-section-skills2": "<b>Understanding of Architecture:</b> Working with a PostgreSQL database exposed via a GraphQL API\n                      on Hasura and connected to Nhost allowed me to better understand the strengths and limitations of these technologies,\n                      optimizing the application's performance and efficiency.",
  "truetourism-ccl-section-skills3": "<b>Adaptation and Learning:</b> I quickly learned and integrated new technologies like React Native,\n                      TypeScript, and GraphQL. This experience reinforced my ability to learn autonomously and integrate\n                      these technologies effectively into my projects.",
  "truetourism-ccl-section-skills4": "<b>Code Analysis:</b> I developed a structured and methodical approach to analyze and modify\n                      pre-existing code, which was essential to successfully complete my tasks.",
  "truetourism-ccl-section-subtitle1": "Technical Skills Developed:",
  "truetourism-ccl-section-subtitle2": "Interpersonal Skills Developed:",
  "truetourism-ccl-section-skills5": "<b>Communication and Collaboration:</b> Working on this project allowed me to develop crucial interpersonal skills,\n                      such as effective communication, conflict management, and collaboration within a multidisciplinary team.",
  "truetourism-ccl-section-skills6": "<b>Project Management:</b> By setting up project management tools on Notion, I learned to coordinate technical teams\n                      with the marketing and communication departments, ensuring effective and transparent activity management.",
  "truetourism-ccl-section-skills7": "<b>Adaptability:</b> The necessity to quickly adapt to the tools and technologies used as well as the changing needs\n                      of the team demonstrated my flexibility in a dynamic environment.",

  "truetourism-img-maestro-code-label": "Maestro Script",
  "truetourism-img-maestro-code-alt": "Image of Maestro code",

  "truetourism-video-maestro-label": "Maestro in Action",

  "truetourism-img-guide-profile-label": "",
  "truetourism-img-guide-profile-alt": "Image of a guide's profile on the app.",

  "truetourism-img-google-signin-code-label": "Code for redirecting to Google login",
  "truetourism-img-google-signin-code-alt": "Image of the code redirecting to Google login.",

  "truetourism-img-old-signup-screen-label": "Old account creation screen (screen 1)",
  "truetourism-img-old-signup-screen-alt": "Image of the old account creation screen.",

  "truetourism-img-new-signup-screen-label": "New account creation screen (screen 1)",
  "truetourism-img-new-signup-screen-alt": "Image of the new account creation screen.",

  "truetourism-img-diagram-label": "Diagram",
  "truetourism-img-diagram-alt": "Image of the diagram",

  "truetourism-img-notion-label": "Excerpt from TrueTourism's Notion",
  "truetourism-img-notion-alt": "Image of TrueTourism's Notion."
}
