{
  "meta-index": {
    "portfolio-title": "Tom SIOUAN - Portfolio",
    "portfolio-og-title": "Page principale du portfolio",
    "portfolio-og-content": "Developpeur full-stack. Je suis passionné par les nouvelles technologies et je suis toujours à la recherche de nouveaux projets à réaliser."
  },

  "home-title": "Tom Siouan",
  "home-first-subtitle": "Étudiant en BUT Informatique",
  "home-second-subtitle": "à l'IUT Nord-Franche-Comté situé à Belfort(FR).",

  "home-slogan": "Développeur full stack",

  "learn-more": "En savoir plus...",

  "filter-by-tag": "Filtrer par tags",

  "nav-about": "À propos",
  "nav-skills": "Compétences",
  "nav-projects": "Projets",
  "nav-stages": "Stages",
  "nav-contact": "Me contacter",

  "video-not-working": "Votre navigateur ne supporte pas la vidéo.",

  "download-cv": "Télécharger mon CV",

  "section-title-about-me": "À propos",
  "section-about-me-first-paragraph": "Bonjour! Pour me présenter, je m'appel Tom, j'ai 20 ans. Je suis passionné d'informatique dépuis l'âge de mes 6 ans environ. Je m'y suis toujours intéressé, ça s'est fait assez naturellement pour moi. Je porte un grand intérêt par la capacité de création que nous offre la technologie mais je porte aussi, un regard sur les possibilité d'améliorer notre quotidien et le monde qui nous entour. J'ai appris la programmation vers l'âge de mes 17 ans. Je codais toute fois des scripts sur minecraft jusque là. J'ai toujours aimé les défis et créer des choses innovantes. Mon enthousiasme pour l'innovation numérique et ma soif de connaissances me poussent constamment à apprendre et à expérimenter de nouvelles technologies, afin de contribuer à l'évolution du monde numérique.",
  "section-about-me-second-paragraph": "Je suis actuellement en 2<sup>ème</sup> année BUT Informatique, on y apprend différents domaines comme l'algorithmique, l'optimisation, les réseaux, les bases de données la modélisation...",

  "timeline-bac-date": "2022",
  "timeline-bac-title": "Baccalauréat technologique STI2D",
  "timeline-bac-description": "Sciences et Technologies de l’Industrie et du Développement Durable, <br/>option: Système d’information et Numérique",

  "timeline-but-date": "1<sup>er</sup> Septembre 2022",
  "timeline-but-title": "Entré en BUT Informatique",
  "timeline-but-description": "Bachelor Universitaire de Technologie.",
  "timeline-but-sub-description": "✅ 1<sup>ère</sup> année validée.",

  "timeline-stage-truetourism-date": "8 Avril - 31 Juin, 2024",
  "timeline-stage-truetourism-title": "Stage analyste programmeur",
  "timeline-stage-truetourism-description-first-part": "Stage réalisé en 2<sup>ème</sup> année de BUT chez ",
  "timeline-stage-truetourism-description-second-part": ". Une startup marseillaise dans le monde du tourisme.",

  "section-title-projects": "Mes Projets",
  "section-title-stages": "Stages",
  "section-title-contact": "Me contacter",

  "footer-first": "Étudiant en informatique",
  "footer-second": "Basé à Belfort (90), France",
  "footer-third": "Je travaille actuellement sur des projets personnels en plus de ceux de l'école.",
  "footer-used-techno": "Site web réalisé avec",

  "today": "aujourd'hui",

  "heldia-title": "Heldia",
  "heldia-image-alt": "image du jeux intitulé Heldia",
  "heldia-description": "Projet consistant en la réalisation d'un jeux vidéo RPG 2D.",
  "heldia-content": "<section id=\"introduction\">\n      <h2 class=\"font-kineticRegular text-3xl text-start font-extrabold mb-5\">Introduction</h2>\n      <p class=\"text-justify\" >\n        Aillant toujours été passionné de jeux vidéo depuis mon plus jeune age, j'ai décidé, en 2022 de créer un jeux. Étant fan des jeux 2D (pokémon et zelda aillant bercé mon enfance),\n        je décide donc de créer un jeux. Je ne savais pas par où commencer parce que je ne connaissait presque pas la programmation à cette époque. En revanche, ce que je savais, c'était que je voulais créer\n        un jeux dans lequel je pourrais retrouver l'ambiance des anciens Pokémons et des Zeldas. Comme j'avais déjà une petite connaissance du C# à cette époque, je suis tombé assez rapidement sur le framework\n        <a class=\"text-color-transition text-blue-500 underline dark:hover:text-blue-400 hover:text-blue-400\" href=\"https://monogame.net/\">Monogame</a> (anciennement XNA), framework qui a été utilisé pour le développement de Terraria et Stardiew-Valley. J'ai ensuite commencé à me documenter\n        sur ce framework à l'aide de vidéos youtube bien que peu nombreuse ainsi que sur l'architecture à apporter pour faire tourner un jeux en partant de zéro. C'est ici que commence réellement mon projet.\n      </p>\n    </section>\n    <section id=\"developpement\" class=\"text-justify\">\n      <h2 class=\"font-kineticRegular text-3xl text-start font-extrabold mt-10 mb-5\">Architecture</h2>\n      <p>\n        J'ai commencé par créer l'architecture du jeux basé sur un système d'écran (que j'appel des pages) c'est à dire qu'il y a une class qui manage mes écrans, elle définit quel écran afficher ou non.\n        Les pages gèrent ensuite le rafraichissement de l'écran(FPS) et de la logique du jeux(TPS) par elles même.\n      </p>\n\n      <h2 class=\"font-kineticRegular text-3xl text-start font-extrabold mt-10 mb-5\">Joueur</h2>\n      <p>\n        Lors de l'implémentation d'un joueur, plusieurs idées et défis sont apparus rapidement.\n        J'ai dû créer un système pour jouer des animations à l'aide d'une spritesheet, une caméra pour suivre mon joueur,\n        un système d'endurance et de vie, ainsi que gérer les keybinds.\n        J'ai donc commencé par créer un système d'animation pour rendre des spritesheets afin d'avoir une image animée.\n      </p>\n\n      <h2 class=\"font-kineticRegular text-3xl text-start font-extrabold mt-10 mb-5\">Spritesheet et animations</h2>\n      <p>\n        Le résultat n'a pas été immédiat, mais j'ai finalement créé une classe Spritesheet couplée à un gestionnaire de fichiers qui renvoie le fichier correspondant.\n        Ensuite, une classe d'animation se charge d'animer le fichier.\n      </p>\n\n      <h2 class=\"font-kineticRegular text-3xl text-start font-extrabold mt-10 mb-5\">Caméra</h2>\n      <p>\n        Après avoir animé mon joueur, je l'ai déplacé temporairement avec des contrôles écrits en dur dans le code du joueur.\n        Ces contrôles n'étaient pas flexibles, car il n'y avait pas de menu de paramètres à ce moment-là.\n        Mon joueur bougeait, mais l'écran restait figé en x=0 et y=0. J'ai donc créé une classe Camera qui, avec quelques calculs matriciels simples, permet de suivre mon joueur.\n      </p>\n\n      <h2 class=\"font-kineticRegular text-3xl text-start font-extrabold mt-10 mb-5\">Spritesheet Manager</h2>\n      <p>\n        Ce résultat n'a pas été atteint immédiatement, mais en commençant à implémenter les tiles composant l'environnement,\n        j'ai réalisé qu'un gestionnaire pour gérer quelles sprites afficher serait efficace. J'ai donc créé le TilesManager.\n      </p>\n\n      <h2 class=\"font-kineticRegular text-3xl text-start font-extrabold mt-10 mb-5\">ObjectManager</h2>\n      <p>\n        Il prend un tableau en paramètre et se charge du rendu des éléments.\n        Je l'utilise pour rendre la carte.\n      </p>\n\n      <h2 class=\"font-kineticRegular text-3xl text-start font-extrabold mt-10 mb-5\">Carte</h2>\n      <p>\n        Actuellement, la carte fonctionne sur le principe de la génération procédurale avec du bruit de Perlin.\n        Mais j'ai prévu de remplacer cette génération par une carte fixe. Pour cela, j'ai besoin de créer mon propre logiciel de mapping\n        pour pouvoir créer ma carte et obtenir un fichier exploitable par mon jeu. C'est une tâche ardue, donc je n'y ai pas encore prêté attention.\n        Actuellement, la carte utilise un ObjectManager pour rendre ses composants.\n      </p>\n\n      <h2 class=\"font-kineticRegular text-3xl text-start font-extrabold mt-10 mb-5\">Collisions</h2>\n      <p>\n        Chaque GameObject possède un rectangle qui correspond à sa hitbox interne. J'ai utilisé cela pour créer ma classe Collision qui prend\n        deux objets de type GameObject en paramètre et vérifie s'ils se touchent.\n      </p>\n      <p>\n        Lorsque mon joueur touche un autre objet présent dans mon ObjectManager, cela est remonté et ensuite, depuis la classe Joueur, je décide\n        de l'action à effectuer en cas de collision. Pour l'instant, je n'ai pas implémenté d'ennemis, donc il n'y a qu'un seul ObjectManager.\n        Cependant, lorsque j'aurai implémenté un système de couches, ce sera plus optimisé et le programme n'aura plus besoin de parcourir tous les objets pour vérifier\n        les collisions.\n      </p>\n\n      <h2 class=\"font-kineticRegular text-3xl text-start font-extrabold mt-10 mb-5\">Vie et Stamina</h2>\n      <p>\n        Maintenant que j'avais un système de collision et un joueur capable de se déplacer, j'ai décidé d'implémenter un système de vie\n        et de stamina. J'ai créé deux objets, mais j'ai rencontré un problème lié à l'affichage. Je ne pouvais pas placer ces deux objets sur le même plan que le joueur\n        puisqu'ils ne font pas partie concrètement du jeu. J'ai dû créer un système d'Overlay pour les afficher et qu'ils restent statiques à l'écran.\n      </p>\n\n      <h2 class=\"font-kineticRegular text-3xl text-start font-extrabold mt-10 mb-5\">Timer</h2>\n      <p>\n        Lorsque j'ai codé mes systèmes de vie et de stamina, je n'ai pas immédiatement pensé à implémenter un timer. J'ai rapidement rencontré le\n        problème de ne pas pouvoir faire perdre de la vie à mon joueur tout en lui faisant perdre ou gagner de la stamina.\n        Après des recherches, j'ai découvert l'importance du Timer. En effet, dans un jeu, tout est minuté. J'ai donc créé une\n        classe Timer que j'ai implémentée dans le Spritesheet Manager afin de gérer la vitesse de défilement de l'image.\n        Je l'ai également utilisée pour gérer ma variable de temps local au jeu. Le Timer me permet aussi de calculer les fréquences TPS et FPS.\n      </p>\n\n      <h2 class=\"font-kineticRegular text-3xl text-start font-extrabold mt-10 mb-5\">Singleton</h2>\n      <p>\n        Ensuite, j'ai voulu implémenter des paramètres pour gérer les contrôles du jeu. Ces paramètres sont encore en cours de développement.\n        Il me fallait une classe pour centraliser les données et les échanger plus facilement entre les différents composants.\n        J'ai donc créé un Singleton pour simplifier cette gestion. Cela m'a permis de gagner en performance en réduisant les transactions de données entre\n        les classes.\n        Après l'implémentation du Singleton, j'ai modifié ma classe Camera pour lui permettre de se rendre à un point défini et ainsi créer des cinématiques.\n      </p>\n\n      <h2 class=\"font-kineticRegular text-3xl text-start font-extrabold mt-10 mb-5\">Contrôles</h2>\n      <p>\n        J'avais déjà mon système d'Overlay, j'ai simplement ajouté un overlay pour les contrôles. Ceux-ci sont encore en développement.\n      </p>\n\n      <h2 class=\"font-kineticRegular text-3xl text-start font-extrabold mt-10 mb-5\">À faire</h2>\n      <p>\n        Le projet n'étant pas terminé, il me reste beaucoup de choses à faire. Actuellement, je travaille sur les paramètres pour pouvoir changer les contrôles en jeu.\n        Ensuite, j'ai prévu de me lancer dans le changement des animations afin de permettre à mon joueur d'attaquer des ennemis.\n      </p>\n    </section>\n    <section id=\"conclusion\" class=\"text-justify\">\n      <h2 class=\"font-kineticRegular text-3xl text-start font-extrabold mt-10 mb-5\">Conclusion</h2>\n      <p>\n        Grâce à ce projet, bien que non terminé, j'ai appris le C# et Monogame de manière approfondie.\n        J'ai acquis les fondamentaux liés à la création d'un jeu vidéo 2D. Je connais désormais l'une des architectures possibles pour un projet\n        de jeu vidéo 2D. Ce projet a également changé ma manière de concevoir et d'aborder le code. Il m'a permis de développer mes compétences en\n        algorithmie.\n      </p>\n    </section>",

  "portfolio-title": "Portfolio",
  "portfolio-image-alt": "image du portfolio (site actuel)",
  "portfolio-description": "Site sur lequel vous êtes actuellement.",
  "portfolio-content": "<section id=\"introduction\">\n      <h2 class=\"font-kineticRegular text-3xl text-start font-extrabold mb-5\">Introduction</h2>\n      <p class=\"text-justify\" >\n        Ce projet répond au besoin premier de réaliser un portfolio sous forme de site dans le cadre du BUT Informatique. J'ai toute fois toujours\n        plus ou moin eu à l'idée de créer un site dans ce but.\n      </p>\n    </section>\n    <section id=\"developpement\" class=\"text-justify\">\n      <h2 class=\"font-kineticRegular text-3xl text-start font-extrabold mt-10 mb-5\">Technologies utilisées</h2>\n      <p>\n        J'avais besoin d'une technologie me permettant d'arriver rapidement à un résultat. Je suis tombé sur nuxt tout à fait par hasard et\n        ai décidé très rapidement que c'était la technologie que j'allais utiliser. En lisant la documentation j'ai vite compris que ce framework me\n        permettrait de mettre mon site en place rapidement grâce au différents modules qu'il propose. Aussi, j'ai décidé d'utiliser tailwindcss pour\n        gagner du temps.\n      </p>\n\n      <h2 class=\"font-kineticRegular text-3xl text-start font-extrabold mt-10 mb-5\">Design</h2>\n      <p>\n        J'ai opté pour un design épuré basé sur le Noir et Blanc donnant un fort contrast sur les bon écrans. Je me suis également\n        focalisé sur les animations afin de dynamiser le site.\n      </p>\n      <h2 class=\"font-kineticRegular text-3xl text-start font-extrabold mt-10 mb-5\">Langues</h2>\n      <p>\n        J'ai utilisé le module\n        <a class=\"text-color-transition text-blue-500 underline dark:hover:text-blue-400 hover:text-blue-400\" href=\"https://nuxt.com/modules/i18n\">nuxt/i18n</a>\n        pour traduire mon site. Ce qui me pose problème avec cette technologie c'est que nuxt/i18n ne propose qu'une traduction coté client donc j'envisage de\n        revoir mon système de traduction dans le future.\n      </p>\n    </section>\n    <section id=\"conclusion\" class=\"text-justify\">\n      <h2 class=\"font-kineticRegular text-3xl text-start font-extrabold mt-10 mb-5\">Conclusion</h2>\n      <p>\n        Ce projet m'a offert l'opportunité d'appliquer les connaissances et compétences que j'ai développées au cours des deux premières années de mon BUT Informatique, tant en réseau qu'en programmation. J'ai également pu mettre à profit l'expérience acquise durant mon stage.\n      </p>\n    </section>",

  "mediaplayer-title": "QTMP",
  "mediaplayer-image-alt": "Image du lecteur multimédia",
  "mediaplayer-description": "Lecteur multimédia.",
  "mediaplayer-content": " <section id=\"introduction\">\n      <h2 class=\"font-kineticRegular text-3xl text-start font-extrabold mb-5\">Présentation du projet</h2>\n      <p class=\"text-justify\" >\n        Ce projet consiste en la réalisation d’un lecteur multimédia développé en C++ à l’aide du\n        framework QT(version 6.6.3). Dans un premier temps mon but était d’implémenter les fonctions\n        basiques d’un lecteur vidéo. C’est-à-dire permettre de jouer une vidéo et la gérer via des\n        boutons et une barre de progression.\n        Ce lecteur multimédia permet donc la lecture de fichiers vidéo et audio tel que des\n        fichiers .mp4, .mkv, .avi, .mov par le billet d’un simple drag and drop ou simplement en cliquant\n        sur un bouton et en allant chercher le fichier manuellement. Il y est possible de créer une\n        playlist de fichier ainsi qu’une bibliothèque. La bibliothèque est persistante. C’est-à-dire que les\n        fichiers qui y sont placés y resteront même après un redémarrage de l’application.\n      </p>\n    </section>\n    <section id=\"developpement\" class=\"text-justify flex flex-col gap-4\">\n\n      <h2 class=\"font-kineticRegular text-3xl text-start font-extrabold mt-10\">Utilisation de l'application</h2>\n      <div class=\"flex flex-col gap-4\">\n        <p>\n          L’utilisation de l’application est très simple. Au lancement de l’application on a ce visuel :\n        </p>\n\n        <img src=\"/images/qt-mediaplayer/home.webp\" alt=\"Image du lecteur multimedia\" class=\"w-2/3 mt-10 mb-10 rounded-lg mx-auto\" />\n\n        <p>\n          On constate tout de suite la présence de trois zones ainsi que la possibilité de drag and\n          drop un fichier dans la zone principale grâce à la présence de l’image et du texte « Drop media\n          here ». L’utilisateur a aussi la possibilité en cliquant sur le bouton « play », de choisir un fichier\n          manuellement. Ce bouton permet aussi de jouer les vidéos/musiques. En la version actuelle du\n          projet, en cliquant sur les différents onglets de la sidebar, si l’utilisateur a importé des fichiers en\n          faisant soit click droit « Ajouter un nouvel élément » soit en faisant un drag and drop, on obtient\n          ce visuel :\n        </p>\n\n        <img src=\"/images/qt-mediaplayer/playlist.webp\" alt=\"Image du lecteur multimedia\" class=\"w-2/3 mt-10 mb-10 rounded-lg mx-auto\" />\n\n        <p>\n          Ici on a donc une table qui apparaît contenant la liste des fichiers transmis au\n          programme. Chaque liste est indépendante. C’est-à-dire que « Playlist » ne contient pas la\n          même liste de fichiers que « Media Library ». On retrouve dans ces listes des informations clés\n          telles que le titre, l’auteur et la durée totale de chaque fichier. (L’auteur reste à implémenter, il\n          faudrait passer par une librairie externe). Pour chaque section de la sidebar on retrouve ce\n          même visuel. En allant dans « My Videos » on trouve toutes les vidéos (.mp4, .avi, .mkv, .mov)\n          présentes dans le dossier vidéo dédié du système d’exploitation. En double cliquant sur une\n          ligne on peut lire une vidéo ou une musique. Si c’est une musique qui est double-cliquée, on\n          reste sur ce visuel sous forme de liste, sinon si c’est une vidéo, un aperçu se lance :\n        </p>\n\n        <img src=\"/images/qt-mediaplayer/playing.webp\" alt=\"Image du lecteur multimedia\" class=\"w-2/3 mt-10 mb-10 rounded-lg mx-auto\" />\n\n        <p>\n          L’utilisateur a la possibilité de mettre en pause ou de reprendre la vidéo/musique au\n          moment arrêté grâce au bouton play. Il peut augmenter le volume grâce à la barre de son.\n          Mettre la fenêtre en plein écran fenêtré grâce au bouton en bas à droite de la fenêtre ou encore\n          quitter le média en cliquant sur le bouton stop. Avancer ou reculer en cliquant sur la barre de\n          progression (sous Linux il faut prendre le slider et le faire glisser).\n        </p>\n\n        <p>\n          Depuis les écrans Playlist, My Videos et prochainement My Music (qui reste à\n          implémenter), il est possible en faisant un click droit, de supprimer de la liste un item ou de le\n          copier dans Media Library.\n        </p>\n\n        <p>\n          Il reste donc à implémenter la section My Music et la possibilité d’avancer dans une\n          playlist. Les boutons « previous » et « next » ne fonctionnent pas.\n        </p>\n\n        <img src=\"/images/qt-mediaplayer/copy-to-library.webp\" alt=\"Image du lecteur multimedia\" class=\"w-2/3 mt-10 mb-10 mx-auto\" />\n      </div>\n\n      <h2 class=\"font-kineticRegular text-3xl text-start font-extrabold mt-10\">Points restants à développer</h2>\n      <div class=\"flex flex-col gap-4\">\n        <p>\n          L’application est loin d’être terminée. Le but est à termes d’avoir un lecteur multimédia\n          complet. On pourrait penser à l’implémentation d’un système de lecture des photos qui les lirait\n          durant une dizaine de secondes comme le fait VLC pour par exemple pouvoir réaliser des\n          diaporamas. Il reste également à implémenter le système de défilement des playlists, qui\n          aujourd’hui n’est pas opérationnel. J’entends par là le fait que lorsqu’une vidéo est jouée et se\n          termine; au lieu de revenir sur l’écran avec la liste des vidéos/musiques, l’application continue\n          en jouant le média d’après dans la liste. Les boutons « previous » et « next » permettraient de\n          changer le média en cours de lecture en chargeant le média d’avant ou d’après dans la liste.\n          Enfin, il reste à mettre en place la logique de la barre de menus pour obtenir une application\n          bien finie, du moins en termes de fonctionnalités.\n        </p>\n      </div>\n\n      <h2 class=\"font-kineticRegular text-3xl text-start font-extrabold mt-10\">Description technique</h2>\n      <div class=\"flex flex-col gap-4\">\n        <p>\n          Le développement de ce projet a constitué une opportunité significative pour moi, non\n          seulement en matière d'élargissement de mes compétences techniques, mais aussi en ce qui\n          concerne ma compréhension approfondie du langage de programmation C++ et de\n          l'application pratique du framework QT. L'immersion dans le langage C++ a été une expérience\n          enrichissante; ce langage, reconnu pour sa complexité et sa puissance, m'a défié et encouragé\n          à améliorer ma logique de programmation. Grâce à ce projet, j'ai pu explorer des aspects\n          avancés du C++, tels que la gestion de la mémoire, ce qui a renforcé ma base technique et\n          élargi ma palette de compétences en développement logiciel.\n        </p>\n\n        <p>\n          L'intégration du framework QT dans ce projet a été une révélation, m'ouvrant les portes à\n          une multitude de fonctionnalités graphiques et à une approche simplifiée de la conception\n          d'interfaces utilisateur. QT, en tant que framework cross-platform, m'a permis de créer une\n          application visuellement attrayante, capable de s'exécuter sur divers systèmes d'exploitation\n          sans modification significative du code source. Cette flexibilité s'est avérée précieuse, me\n          faisant apprécier l'importance de la portabilité et de l'accessibilité dans le développement de\n          logiciels modernes.\n        </p>\n\n        <p>\n          Pour réaliser ce projet, je me suis principalement aidé de stack overflow et d’autres\n          forums en tous genres.\n        </p>\n      </div>\n\n      <h2 class=\"font-kineticRegular text-3xl text-start font-extrabold mt-10\">Difficultés rencontrées</h2>\n      <p>\n        Concernant les difficultés rencontrées, je me suis principalement heurté à des problèmes\n        de fuites de mémoire, dus à une utilisation incorrecte des pointeurs et à une compréhension\n        incomplète du C++. Ces erreurs ont occasionné la perte de plusieurs heures, mais grâce à\n        l'usage efficace du débogueur, j'ai finalement pu les résoudre. Ce qui m’a permis d’améliorer\n        mes capacités en matière de débuging. Aussi, naviguer à travers l'abondance de fonctionnalités\n        offertes par QT s'est révélé complexe, exacerbé par une documentation qui, selon moi, pourrait\n        être améliorée pour faciliter l'apprentissage et l'application de ce framework.\n      </p>\n    </section>\n    <section id=\"conclusion\" class=\"text-justify\">\n      <h2 class=\"font-kineticRegular text-3xl text-start font-extrabold mt-10 mb-5\">Conclusion</h2>\n      <p>\n        Ce projet de lecteur multimédia, développé en C++ avec le framework QT (version 6.6.3), a été une expérience d'apprentissage significative.\n        Initialement destiné à implémenter les fonctions basiques d'un lecteur vidéo, le projet a évolué pour prendre en charge la lecture de fichiers\n        vidéo et audio pour divers formats tels que .mp4, .mkv, .avi et .mov. L'application permet aux utilisateurs de créer des playlists et de\n        maintenir une bibliothèque multimédia persistante, offrant une expérience utilisateur fluide et conviviale.\n      </p>\n      <p>\n        Le processus de développement a été assez simple, avec une fonctionnalité intuitive de glisser-déposer et une sélection manuelle de\n        fichiers améliorant l'interaction utilisateur. Malgré quelques défis, tels que la gestion des fuites de mémoire et la navigation dans\n        les nombreuses fonctionnalités de QT, ces obstacles ont fourni des leçons précieuses en matière de débogage et souligné l'importance\n        d'une documentation approfondie.\n      </p>\n      <p>\n        Les améliorations futures incluent l'implémentation de la section \"Ma Musique\", la progression des playlists et l'amélioration de\n        l'interface utilisateur. Ce projet a non seulement élargi mes compétences techniques en C++ et QT, mais a également approfondi ma\n        compréhension de la portabilité des logiciels et du développement multiplateforme.\n      </p>\n      <p>\n        Dans l'ensemble, ce projet m'a permis d'appliquer mes connaissances et compétences dans un contexte pratique, me préparant à\n        des défis plus complexes en développement logiciel. L'expérience a souligné l'importance de la persévérance, de l'apprentissage\n        continu et de l'utilisation des ressources communautaires telles que Stack Overflow pour résoudre les problèmes.\n      </p>\n    </section>",

  "habit-tracker-title": "HabitTracker",
  "habit-tracker-image-alt": "Image de l'application",
  "habit-tracker-description": "Application Swift de gestion des habitudes.",
  "habit-tracker-content": "<section id=\"introduction\">\n      <h2 class=\"font-kineticRegular text-3xl text-start font-extrabold mb-5\">Présentation</h2>\n      <p class=\"text-justify\" >\n        HabitTracker est comme son nom l'indique un tracker d'habitude qui vous permet de lister vos habitudes,\n        les programmer par récurrence (tous les jours, tous les deux jours...) et à l'aide d'un calendrier,\n        d'observer la liste de vos habitudes pour chaque jour.\n      </p>\n      <p>\n        Cette application est née d'un projet universitaire dans le but de nous former au language Swift et\n        a la programmation mobile en général.\n      </p>\n    </section>",

  "ezcon-title": "EZCON",
  "ezcon-image-alt": "Image du site web",
  "ezcon-description": "Site web d'une convention du jeux vidéo",
  "ezcon-content": "<section id=\"introduction\">\n      <h2 class=\"font-kineticRegular text-3xl text-start font-extrabold mb-5\">Introduction</h2>\n      <p class=\"text-justify\" >\n        Ce site web est issu d'un projet universitaire dans lequel nous devions créer un site web lié à un événement.\n        Ce site web est donc dédié à une convention du jeux vidéo nommé EzCon qui est sensé se déroulé à Belfort(90) en France.\n      </p>\n    </section>\n    <section id=\"developpement\" class=\"text-justify\">\n      <h2 class=\"font-kineticRegular text-3xl text-start font-extrabold mt-10 mb-5\">But</h2>\n      <p>\n        Ce projet vise à offrir un panel de services complémentaire à la convention. On y retrouve l'administration des intervenants,\n        permettant de gérer les stands à attribuer ainsi que la gestion du planning et des événements. Planning et événements qui sont visualisables\n        depuis le site grâce à la carte(map) de la convention.\n      </p>\n\n      <h2 class=\"font-kineticRegular text-3xl text-start font-extrabold mt-10 mb-5\">Fonctionnalités</h2>\n      <ul class=\"list-disc pl-12 flex flex-col pl-10 gap-4\">\n        <li>\n          Calendrier des Événements : Consultez le calendrier pour connaître tout les événements sur le salon.\n        </li>\n        <li>\n          Réservation en Ligne : Réservez votre billets, ainsi que les divers produits fournit par les divers intervenants.\n        </li>\n        <li>\n          Informations : Découvrez le monde du jeux vidéo comme vous ne l'avez jamais vu...\n        </li>\n        <li>\n          Traduction : Le site est traduit en anglais pour les visiteurs.\n        </li>\n      </ul>\n    </section>\n    <section id=\"conclusion\" class=\"text-justify\">\n      <h2 class=\"font-kineticRegular text-3xl text-start font-extrabold mt-10 mb-5\">Conclusion</h2>\n      <p>\n        Ce projet m'a permis de développer une bonne connaissance de Vue.js 2 ainsi que d'améliorer ma capacité à travailler en groupe et ma compréhension des méthodes de gestion de projet agiles. Grâce à cette expérience, j'ai acquis des compétences précieuses en développement web, coordination de projet et application pratique des frameworks de développement modernes.\n      </p>\n      <p>\n        Dans l'ensemble, le projet du site EzCon a été une opportunité d'apprentissage significative, me permettant d'appliquer des connaissances théoriques dans un contexte pratique. Cette expérience a été déterminante pour me préparer aux futurs défis dans le domaine du développement web et de la gestion de projet.\n      </p>\n    </section>",

  "index-contact-me-p1": "Étudiant en 2ème année de BUT, je suis à la recherche de nouvelles opportunités pour mettre en pratique mes compétences et collaborer sur des projets innovants.",
  "index-contact-me-p2": "Vous pouvez m'envoyer un <a href=\"#email-form\">email</a> ou me contacter sur les réseau suivants ↓",

  "form-fullname": "Nom Prénom",
  "form-email": "Email",
  "form-subject": "Sujet",
  "form-message": "Message",
  "form-send-button": "Envoyer",

  "index-truetourism-paragraph": "Lors de ma 2<sup>ème</sup> année en BUT Informatique, j'ai effectué un stage sur une duré de 8 semaines dans une startup intitulée True Tourism.\n            Pendant ce stage, j'ai eu l'opportunité de travailler sur le développement d'une application mobile innovante dédiée au tourisme à Marseille.\n            Mon rôle comprenait la conception et l'implémentation de fonctionnalités clés telles que l'optimisation du cache applicatif, l'ajout de profile utilisateur\n            , l'envoie de notifications et de mails aux utilisateurs, templatiser les mails, l'ajout de google comme fournisseur d'authentification et la création de test\n            E2E. Cette expérience m'a non seulement permis de renforcer mes compétences techniques, mais m'a aussi\n            donné un aperçu précieux de l'environnement dynamique des startups...",

  "truetourism-title": "Stage chez True Tourism",
  "truetourism-introduction": "Lors de ma 2<sup>ème</sup> année en BUT Informatique, j'ai effectué un stage sur une duré de 8 semaines dans une startup intitulée True Tourism\n          constitué de 4 membres. Pendant ce stage, j'ai eu l'opportunité de travailler sur le développement d'une application mobile innovante dédiée au\n          tourisme à Marseille. Mon rôle comprenait la conception et l'implémentation de fonctionnalités clés telles que l'optimisation du cache applicatif,\n          l'ajout de profile utilisateur, l'envoie de notifications et de mails aux utilisateurs, templatiser les mails, l'ajout de google comme fournisseur\n          d'authentification et la création de test E2E. Cette expérience m'a non seulement permis de renforcer mes compétences techniques, mais m'a aussi\n          donné un aperçu précieux de l'environnement dynamique des startups.",
  "truetourism-first-section-title": "Développement d'une application React Native",
  "truetourism-first-section-p1": "Durant mon stage j'ai développé des fonctionnalités pour une application mobile en utilisant\n              <a href=\"https://reactnative.dev\" class=\"text-color-transition text-blue-500 underline dark:hover:text-blue-400 hover:text-blue-400\">React Native</a>,\n              <a href=\"https://graphql.org\" class=\"text-color-transition text-blue-500 underline dark:hover:text-blue-400 hover:text-blue-400\">GraphQL</a> et\n              <a href=\"https://www.typescriptlang.org\" class=\"text-color-transition text-blue-500 underline dark:hover:text-blue-400 hover:text-blue-400\">TypeScript</a>.\n              J'ai participé activement aux discussions sur la structure du code et j'ai dû surmonter les défis liés au manque\n              de documentation technique. Ce travail a impliqué le développement d'une page de profil publique dédiée aux guides présents sur l'application,\n              l'implémentation de Google comme fournisseur d'authentification, ainsi que la création de tests End-to-End pour garantir la fiabilité de l'application.",
  "truetourism-first-section-subtitle1": "Tests End-to-End",
  "truetourism-first-section-p2": "La première mission qui m'a été confiée était de créer des tests End-to-End avec <a href=\"https://maestro.mobile.dev\" class=\"text-color-transition text-blue-500 underline dark:hover:text-blue-400 hover:text-blue-400\">Maestro</a>, une technologie que je ne connaissais pas du tout.\n                      J'ai donc dû apprendre à utiliser cette technologie, qui permet, par le billet de scripts, d'exécuter automatiquement des actions dans le simulateur.\n                      Grâce à une documentation complète, j'ai rapidement pris en main Maestro et pu l'utiliser efficacement.",
  "truetourism-first-section-subtitle2": "Implémentation d'un profile publique dédié au guides",
  "truetourism-first-section-p3": "J'ai également eu pour mission de développer en React Native, un écran de profile dédié aux guides travaillant avec l'entreprise\n                    sur l'application afin que les touristes (utilisateurs de l'application) puissent accéder à celui-ci et voir globalement ce\n                    que propose chaque guide. Pour ce faire, j'ai du dans un premier temps analyser les composants pré-existant dans l'application\n                    afin de les réutiliser ou de les adapter à ma mission afin de garder une certaine harmonie des composants dans l'application.\n                    Cette mission m'a également appris ReactNative et quelques concepts de bases liés à la navigation ainsi que GraphQL qui est le\n                    language utilisé pour requêter la base de donnée.",
  "truetourism-first-section-subtitle3": "Implémentation de google comme fournisseur d'authentification",
  "truetourism-first-section-subtitle4": "Compétences",
  "truetourism-first-section-sub-subtitle1": "Compétences développées :",
  "truetourism-first-section-p4": "Dernièrement, j'ai implémenté Google comme fournisseur d'authentification. Il fallait l'implémenter avec Nhost, un Backend-as-a-Service open source.\n                    Nhost gère la connexion aux comptes utilisateurs de l'application ; il est donc nécessaire de passer par lui pour lier un compte Google à un\n                    utilisateur ou créer un compte via Google.",
  "truetourism-first-section-p5": "Le premier problème rencontré était une erreur liée à l'API de Nhost, rendant l'utilisation des méthodes fournies par Nhost impossible.\n                    Une issue a été créé sur github, c'est un problème qui visiblement est toujours en cours de résolution à l'heure ou j'écris ces mots (11 juin 2024).\n                    J'ai donc dû trouver des alternatives en faisant des recherches sur le web pour pouvoir rediriger l'utilisateur vers l'interface\n                    de connexion Google.",
  "truetourism-first-section-p6": "Le second problème était que lorsque qu'un utilisateur tentait de se connecter avec Google mais que le compte n'existait pas, Nhost\n                    créait automatiquement le compte et connectait l'utilisateur à celui-ci. Cependant, l'application utilise des données que le compte\n                    Google ne peut pas fournir, et ces données sont demandées à l'utilisateur lors de l'inscription via l'application.",
  "truetourism-first-section-p7": " J'ai donc dû remodeler les écrans de création de compte pour séparer la création du compte de la création du profil utilisateur.\n                    Ainsi, une fois connecté via Google (si son compte n'existait pas déjà), l'utilisateur est redirigé vers les écrans de création de profil.",
  "truetourism-first-section-p8": "Les informations prénom et nom ont donc été transférées sur l'écran suivant, permettant de séparer compte et profil dans le flux d'écran.",
  "truetourism-first-section-p9": " J'ai également dû faire en sorte que lorsqu'un utilisateur arrive sur l'application, s'il est connecté mais que son profil n'est pas finalisé,\n                    il soit redirigé vers les écrans de création de profil et ne puisse pas en sortir. J'ai ajouté une variable pour vérifier si le profil\n                    utilisateur est finalisé ou non, ainsi qu'une autre pour savoir si le compte a été créé avec Google.",
  "truetourism-first-section-p10": "Comme la base de données d'authentification est reliée à Nhost et donc non modifiable, toutes les données des utilisateurs\n                    (liées à l'application/profil utilisateur) sont placées dans un champ nommé metadatas. Ce champ contient un objet avec toutes\n                    les variables utilisées par l'application. J'y ai ajouté deux variables booléennes : googleAccount pour savoir si le compte a\n                    été créé avec Google ou non, et completed pour savoir si le profil est complet ou non.",
  "truetourism-first-section-p11": "En fonction de ces variables, j'ai dû modifier les conditions d'affichage des CGU.",
  "truetourism-first-section-p12": "Lorsqu'un touriste crée un compte avec Google, l'application récupère directement l'image que Google renvoie, ce qui m'a obligé à modifier\n                    légèrement la façon dont les images de profil sont affichées. Par contre, lorsqu'un guide crée son compte avec Google, il a le choix entre\n                    ajouter une image de son répertoire ou garder l'image Google.",
  "truetourism-first-section-p13": "Pour la connexion, lorsqu'un compte existait déjà sur Nhost avec une certaine adresse email et que l'utilisateur tentait de se connecter\n                    via Google avec cette même adresse email, Nhost faisait automatiquement le lien et liait le compte Google au compte pré-existant.\n                    Je n'ai donc pas eu à gérer ce cas de figure. Par contre, j'ai dû ajouter dans les options du profil des utilisateurs la possibilité\n                    de lier et délier le compte Google, dans le cas où le compte utilisateur en question n'a pas été créé par Google.",
  "truetourism-first-section-p14": "Enfin, j'ai réalisé un diagramme afin de statuer mon avancement sur la tâche, faire un bilan et permettre aux autres développers de\n                    comprendre plus facilement mon travail.",
  "truetourism-first-section-p15": "Cette tâche m'a permis de développer ma capacité à rechercher des informations précises, comme la consultation d'issues sur GitHub. J'ai pu mieux comprendre l'environnement de travail, qui incluait une base de données PostgreSQL exposée via une API GraphQL fonctionnant sur Hasura, le tout relié à Nhost. Cette compréhension de l'architecture m'a aidé à identifier les avantages et les inconvénients de ces outils. De plus, cela a renforcé ma capacité à analyser du code existant et à m'adapter rapidement à de nouvelles technologies.",
  "truetourism-first-section-skills1": "<b>Recherche et Analyse :</b> Ma capacité à rechercher des informations précises et pertinentes a été grandement améliorée. J'ai utilisé GitHub et d'autres ressources en ligne pour résoudre des problèmes techniques et comprendre les meilleures pratiques.",
  "truetourism-first-section-skills2": "<b>Compréhension de l'Architecture :</b> Travailler avec une base de données PostgreSQL exposée via une API GraphQL sur Hasura et reliée à Nhost m'a permis de mieux comprendre les points forts et les limitations de ces technologies. Cela a été crucial pour optimiser les performances et l'efficacité de l'application.",
  "truetourism-first-section-skills3": "<b>Adaptation et Apprentissage :</b> J'ai pu rapidement m'adapter à des technologies et outils que je ne connaissais pas auparavant. Cette expérience a renforcé ma capacité à apprendre de nouvelles technologies de manière autonome et à les intégrer efficacement dans mes projets.",
  "truetourism-first-section-skills4": "<b>Analyse de Code :</b> Analyser du code préexistant pour comprendre son fonctionnement et le modifier en fonction des besoins m'a aidé à développer une approche structurée et méthodique de la programmation.",
  "truetourism-first-section-skills5": "<b>Maitrise accrue des technologies/outils suivants :</b> React Native, TypeScript, GraphQL, Nhost, Hasura.",

  "truetourism-first-section-subtitle5": "Optimisation du calcul des prix à l'aide de React Query",
  "truetourism-first-section-react-query-alt": "Image de l'implémentation de React Query dans le App.js",
  "truetourism-first-section-fetchPriceDetailsCallback-label": "fonction fetchPriceDetails",
  "truetourism-first-section-fetchPriceDetailsCallback-alt": "Image du code de la fonction fetchPriceDetails définie à l'aide de useCallback.",
  "truetourism-first-section-useQuery-label": "return useQuery",
  "truetourism-first-section-useQuery-alt": "Image du code du hook de retour useQuery.",
  "truetourism-first-section-sub-subtitle2": "Fonctionnement global",
  "truetourism-first-section-p16": "Avant toute chose, qu'est-ce que React Query ? React Query est une bibliothèque de gestion de l'état des requêtes et des données asynchrones dans les applications React.\n",
  "truetourism-first-section-p17": "Les transactions entre l'application et l'API qui renvoie les prix sont payantes au-delà d'un certain niveau. Pour une petite structure comme True Tourism, il était primordial de réduire au maximum le nombre de requêtes.\n",
  "truetourism-first-section-p18": "J'ai donc commencé par implémenter React Query à la racine de l'application :",
  "truetourism-first-section-p19": "Puis j'ai modifié le hook personnalisé nommé <span class=\"bg-gray-300 pl-2 pr-2 rounded\">useFetchPriceDetails</span> pour qu'il utilise React Query :",
  "truetourism-first-section-p20": "La fonction <span class=\"bg-gray-300 pl-2 pr-2 rounded\">fetchPriceDetails</span> est définie à l'aide de\n                  <span class=\"bg-gray-300 pl-2 pr-2 rounded\">useCallback</span> pour mémoriser la fonction et ne la recréer que\n                  lorsque les dépendances changent. Elle fait une requête POST à l'endpoint <span class=\"bg-gray-300 pl-2 pr-2 rounded\">/price</span> avec le corps de\n                  la requête construit en fonction des paramètres.",
  "truetourism-first-section-p21": "<span class=\"bg-gray-300 pl-2 pr-2 rounded\">useQuery</span> est utilisé pour exécuter la fonction <span class=\"bg-gray-300 pl-2 pr-2 rounded\">fetchPriceDetails</span> et gérer son état\n                  (chargement, succès, erreur).<br/>\n                  Les paramètres sont :",
  "truetourism-first-section-p22": "<b>Clé de la requête :</b> Un tableau qui inclut les paramètres nécessaires pour différencier les requêtes.\n                      Cette clé permet de mettre en cache les résultats spécifiques à ces paramètres.",
  "truetourism-first-section-p23": "<b>Fonction de récupération :</b> La fonction <span class=\"bg-gray-300 pl-2 pr-2 rounded\">fetchPriceDetails</span>.",
  "truetourism-first-section-p24": "<b>Options :</b>",
  "truetourism-first-section-p25": "<b>keepPreviousData:</b> Permet de conserver les données précédentes pendant la mise à jour pour éviter les \"flickers\".",
  "truetourism-first-section-p26": "<b>staleTime:</b> Définit le temps pendant lequel les données sont considérées comme fraîches. Ici, il est réglé à\n                          0 si un code de réduction est fourni, sinon à 5 minutes.",
  "truetourism-first-section-p27": "Le terme \"flicker\" (ou \"flickering\") fait référence à un phénomène où une partie de l'interface utilisateur clignote ou change\n                  rapidement d'état de manière visible, souvent de façon inattendue et désagréable pour l'utilisateur. Cela se produit généralement\n                  lorsque les données affichées à l'écran changent trop rapidement ou lorsqu'il y a une période visible entre le chargement des\n                  anciennes et des nouvelles données.\n                  <br/>\n                  Dans le contexte de React Query et du code que vous avez fourni, les \"flickers\" peuvent se produire dans les situations suivantes :",
  "truetourism-first-section-p28": "<b>Chargement des nouvelles données :</b> Lorsqu'une nouvelle requête est faite pour mettre à jour les données, il peut y avoir\n                      un moment où les anciennes données sont supprimées avant que les nouvelles soient complètement chargées. Cela peut provoquer un\n                      clignotement où l'utilisateur voit une interface vide ou un état de chargement avant que les nouvelles données ne soient affichées.",
  "truetourism-first-section-p29": "<b>Changement de l'état de chargement :</b> Si l'application passe rapidement de l'affichage des données à un état de chargement\n                      (par exemple, afficher un indicateur de chargement) et inversement, cela peut entraîner des clignotements visibles.",
  "truetourism-first-section-p30": "<b>Initialisation :</b> La fonction <span class=\"bg-gray-300 pl-2 pr-2 rounded\">useFetchPriceDetails</span> est appelée avec les paramètres nécessaires.\n",
  "truetourism-first-section-p31": "<b>Création de la fonction de récupération :</b> <span class=\"bg-gray-300 pl-2 pr-2 rounded\">fetchPriceDetails</span> est définie et mémorisée.\n",
  "truetourism-first-section-p32": "<b>Exécution de la requête :</b> <span class=\"bg-gray-300 pl-2 pr-2 rounded\">useQuery</span> exécute <span class=\"bg-gray-300 pl-2 pr-2 rounded\">fetchPriceDetails</span> et gère l'état de la requête.",
  "truetourism-first-section-p33": "<b>Gestion du cache et de l'état :</b> React Query met en cache les résultats et gère les différents états (chargement, succès, erreur) de manière transparente.\n",
  "truetourism-first-section-p34": "Pour conclure, cette tâche étant la première sur laquelle je travaillais en React Native et en TypeScript,\n                  j'ai appris à utiliser les types sans surcharger le code. J'ai également appris à créer et à utiliser des hooks\n                  personnalisés et j'ai compris l'importance de garder l'optimisation à l'esprit. De plus, optimiser les requêtes\n                  pour éviter de surcharger les serveurs s'est révélé crucial, surtout pour une petite structure comme True Tourism.\n                  L'implémentation de React Query a non seulement réduit les coûts en minimisant le nombre de requêtes API, mais a\n                  également amélioré l'expérience utilisateur en rendant les transitions de données plus fluides et en évitant les \"flickers\".",

  "truetourism-second-section-title": "Mise en place d'un Notion pour centraliser les outils de gestion",
  "truetourism-second-section-p1": "L'une de mes missions consistait à créer un espace sur Notion pour coordonner les équipes techniques avec les départements\n                  marketing et communication. L'entreprise utilisait divers logiciels, dont Retool, Trello, et HubSpot (CRM, outil de gestion client),\n                  avec pour objectif de centraliser automatiquement toutes les données sur Notion. Ce projet étant secondaire, j'y ai travaillé une\n                  après-midi par semaine à partir de ma 5<sup>ème</sup> semaine de stage, soit un total de 4 après-midis. Je n'ai donc pas\n                  eu le temps de développer tous les aspects de l'entreprise. Pour cela, j'ai dû prendre en compte les attentes de chacun\n                  afin de créer un espace Notion adapté et conforme à l'image de l'entreprise.",
  "truetourism-second-section-p2": "Ce Notion rassemble toutes les données (business, opérationnel, processus, communication). Pour ma part, je me suis concentré uniquement sur les aspects\n                  opérationnel et business (partie utilisateurs).",
  "truetourism-second-section-p3": "J'ai d'abord créé un espace global pour y fixer les objectifs de l'entreprise (simple vue Kanban) et un autre dédié aux réunions hebdomadaires (weekly).\n",
  "truetourism-second-section-p4": "Ensuite, j'ai mis en place un espace pour chaque membre de l'équipe avec une vue Kanban pour gérer les tâches de chacun, à la manière de Trello.\n                  L'entreprise utilisait déjà Trello, mais il était contraignant car, par exemple, pour obtenir un diagramme de Gantt, il fallait payer. Sur Notion, en configurant correctement,\n                  on peut visualiser un Gantt gratuitement. Le facteur coût est crucial dans ce type de structure avec des fonds limités.",
  "truetourism-second-section-p5": "J'ai centralisé la liste des utilisateurs, distinguant deux types : les guides et les touristes.\n                  Ce qui intéressait César, le directeur général et marketing, c'était surtout les guides, car l'entreprise les suit de près.\n                  Il était donc essentiel que César ait accès à différentes vues pour classer les utilisateurs \"guides\" de manière variée.",
  "truetourism-second-section-p6": "Voici une image d'une partie du Notion. Par souci de confidentialité des données, je ne peux pas en montrer plus sur ce site.",
  "truetourism-second-section-p7": "Ce projet m'a permis de développer ma capacité à conduire un projet grâce à la mise en place d'un Notion (outil de gestion) et à\n                    l'appréhension des besoins des utilisateurs, à savoir l'équipe. Il m'a également permis de développer des compétences\n                    interpersonnelles indispensables pour le travail en équipe pluridisciplinaire, telles que la communication, la collaboration,\n                    la gestion des conflits et l'adaptabilité.",
  "truetourism-second-section-skills1": "<b>Appréhension des besoins du client et de l'utilisateur :</b> J'ai appris à recueillir et formaliser les besoins des différents départements pour créer un outil de gestion centralisé et efficace sur Notion.\n",
  "truetourism-second-section-skills2": "<b>Mise en place des outils de gestion de projet :</b> En créant un espace sur Notion, j'ai mis en œuvre des outils de gestion de projet adaptés aux besoins de l'équipe, facilitant ainsi la coordination et le suivi des tâches.\n",
  "truetourism-second-section-skills3": "<b>Identification des acteurs et des phases du cycle de développement :</b> J'ai identifié les rôles et responsabilités de chaque membre de l'équipe pour assurer une répartition claire des tâches et une meilleure collaboration.\n",
  "truetourism-second-section-skills4": "<b>Suivi de projet :</b> J'ai appliqué une démarche de suivi de projet en utilisant des vues Kanban et des diagrammes de Gantt, permettant une gestion efficace et transparente des activités.\n",
  "truetourism-second-section-skills5": "<b>Communication et collaboration :</b> Travailler sur ce projet m'a permis de développer des compétences interpersonnelles cruciales, telles que la communication efficace, la gestion des conflits et la collaboration au sein d'une équipe pluridisciplinaire.\n",
  "truetourism-second-section-subtitle1": "Compétences",
  "truetourism-second-section-sub-subtitle2": "Compétences développées :",

  "truetourism-ccl-section-title": "Conclusion",
  "truetourism-ccl-section-p1": "Ce stage chez True Tourism m'a permis de développer une flexibilité et une capacité d'adaptation\n                essentielles en raison de la diversité des projets menés sur une courte période de huit semaines.\n                Cette expérience a enrichi mes compétences techniques et interpersonnelles, essentielles pour évoluer\n                dans le domaine de l'informatique et de la gestion de projets.",
  "truetourism-ccl-section-skills1": "<b>Recherche et Analyse :</b> J'ai amélioré ma capacité à rechercher des informations précises et pertinentes.\n                        L'utilisation de GitHub et d'autres ressources en ligne pour résoudre des problèmes techniques et comprendre les\n                        meilleures pratiques a été cruciale.",
  "truetourism-ccl-section-skills2": "<b>Compréhension de l'Architecture :</b> Travailler avec une base de données PostgreSQL exposée via une API GraphQL\n                      sur Hasura et reliée à Nhost m'a permis de mieux comprendre les points forts et les limitations de ces technologies,\n                      optimisant ainsi les performances et l'efficacité de l'application.",
  "truetourism-ccl-section-skills3": "<b>Adaptation et Apprentissage :</b> J'ai rapidement appris et intégré de nouvelles technologies comme React Native,\n                      TypeScript, et GraphQL. Cette expérience a renforcé ma capacité à apprendre de manière autonome et à intégrer\n                      efficacement ces technologies dans mes projets.",
  "truetourism-ccl-section-skills4": "<b>Analyse de Code :</b> J'ai développé une approche structurée et méthodique pour analyser et modifier du code\n                      préexistant, ce qui a été essentiel pour mener à bien mes missions.",
  "truetourism-ccl-section-subtitle1": "Compétences Techniques Développées :",
  "truetourism-ccl-section-subtitle2": "Compétences Interpersonnelles Développées :",
  "truetourism-ccl-section-skills5": "<b>Communication et Collaboration :</b> Travailler sur ce projet m'a permis de développer des compétences interpersonnelles cruciales,\n                      telles que la communication efficace, la gestion des conflits et la collaboration au sein d'une équipe pluridisciplinaire.",
  "truetourism-ccl-section-skills6": "<b>Gestion de Projet :</b> En mettant en place des outils de gestion de projet sur Notion, j'ai appris à coordonner les équipes\n                      techniques avec les départements marketing et communication, assurant une gestion efficace et transparente des activités.",
  "truetourism-ccl-section-skills7": "<b>Adaptabilité :</b> La nécessité de s'adapter rapidement aux outils et technologies utilisés ainsi qu'aux besoins changeants\n                      de l'équipe a démontré ma flexibilité dans un environnement dynamique.",

  "truetourism-img-maestro-code-label": "Script Maestro",
  "truetourism-img-maestro-code-alt": "Image de code maestro",

  "truetourism-video-maestro-label": "Fonctionnement de Maestro",

  "truetourism-img-guide-profile-label": "",
  "truetourism-img-guide-profile-alt": "Image du profile d'un guide de l'application.",

  "truetourism-img-google-signin-code-label": "Code du composant renvoyant à la connexion sur google",
  "truetourism-img-google-signin-code-alt": "Image du code de renvoie sur le site de connexion google.",

  "truetourism-img-old-signup-screen-label": "Ancien écran de création de compte (écran 1)",
  "truetourism-img-old-signup-screen-alt": "Image de l'ancien écran de création de compte.",

  "truetourism-img-new-signup-screen-label": "Nouvel écran de création de compte (écran 1)",
  "truetourism-img-new-signup-screen-alt": "Image du nouvel écran de création de compte.",

  "truetourism-img-diagram-label": "Diagramme",
  "truetourism-img-diagram-alt": "Image du diagramme",

  "truetourism-img-notion-label": "Extrait du Notion de TrueTourism",
  "truetourism-img-notion-alt": "Image du notion TrueTourism."
}
